# Before you start :
   - These exercises are related to the Subsetting and Descriptive Stats lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [6]:
import warnings
warnings.simplefilter('ignore')  # ignora los warnings
!pip install matplotlib
!pip install seaborn
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
import numpy as np
import pandas as pd
pd.set_option('display.max_columns', None)

Requirement already satisfied: matplotlib in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (3.3.2)
Requirement already satisfied: numpy>=1.15 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from matplotlib) (1.19.2)
Requirement already satisfied: certifi>=2020.06.20 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from matplotlib) (2020.6.20)
Requirement already satisfied: python-dateutil>=2.1 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from matplotlib) (2.8.1)
Requirement already satisfied: kiwisolver>=1.0.1 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from matplotlib) (1.3.0)
Requirement already satisfied: pillow>=6.2.0 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from matplotlib) (8.0.1)
Requirement already satisfied: cycler>=0.10 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from matplotlib) (0.10.0)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.3 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from matplotlib) (2.4.7)
Requirement already satisfied: six>=1.5 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.1->matplotlib) (1.15.0)
Requirement already satisfied: seaborn in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (0.11.0)
Requirement already satisfied: scipy>=1.0 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from seaborn) (1.5.2)
Requirement already satisfied: pandas>=0.23 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from seaborn) (1.1.3)
Requirement already satisfied: numpy>=1.15 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from seaborn) (1.19.2)
Requirement already satisfied: matplotlib>=2.2 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from seaborn) (3.3.2)
Requirement already satisfied: pytz>=2017.2 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from pandas>=0.23->seaborn) (2020.1)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from pandas>=0.23->seaborn) (2.8.1)
Requirement already satisfied: cycler>=0.10 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from matplotlib>=2.2->seaborn) (0.10.0)
Requirement already satisfied: certifi>=2020.06.20 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from matplotlib>=2.2->seaborn) (2020.6.20)
Requirement already satisfied: pillow>=6.2.0 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from matplotlib>=2.2->seaborn) (8.0.1)
Requirement already satisfied: kiwisolver>=1.0.1 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from matplotlib>=2.2->seaborn) (1.3.0)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.3 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from matplotlib>=2.2->seaborn) (2.4.7)
Requirement already satisfied: six>=1.5 in /Users/joseignacioacasocastro/opt/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas>=0.23->seaborn) (1.15.0)

# Challenge 1

#### In this challenge we will use the `Temp_States.csv` file. 

#### First import it into a data frame called `temp`.

In [8]:
temp=pd.read_csv('/Users/joseignacioacasocastro/Desktop/IRONHACK/lab_subsetting_and_descriptive_stats/your-code/Temp_States.csv')

#### Print `temp`

In [9]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the Temp dataframe. What type of data do we have? Comment your result.

In [10]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

#### Select the rows where state is New York

In [11]:
ny = temp.loc[temp.State=='New York']
ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average of the temperature of cities in New York?

In [12]:
ny.mean()

Temperature    10.740741
dtype: float64

#### We want to know cities and states with Temperature above 15 degress Celcius

In [13]:
temp.loc[temp.Temperature>15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degress Celcius

In [14]:
temp.loc[temp.Temperature>15].City

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### We want to know which cities have a temperature above 15 degrees Celcius and below 20 degrees Celcius

*Hint: First write the condition then select the rows.*

In [15]:
temp.loc[(temp.Temperature>15) & (temp.Temperature<20)]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and the standard deviation of the temperature of each state.

*Hint: Use functions from Data Manipulation lesson*

In [16]:
print(temp.Temperature.mean())

temp.Temperature.std()

15.158730158730156

6.695264939070773

# Challenge 2

#### Load the `employee.csv` file into a DataFrame. Call the dataframe `employee`

In [18]:
employee=pd.read_csv('/Users/joseignacioacasocastro/Desktop/IRONHACK/lab_subsetting_and_descriptive_stats/your-code/Employee.csv')
employee

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the Temp dataframe. Comment your results

In [19]:
employee.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

#### What's the average salary in this company?

In [20]:
employee.Salary.mean()

48.888888888888886

#### What's the highest salary?

In [21]:
employee.Salary.max()

70

#### What's the lowest salary?

In [ ]:
# your answer here

#### Who are the employees with the lowest salary?

In [ ]:
# your answer here

#### Could you give all the information about an employee called David?

In [ ]:
# your answer here

#### Could you give only David's salary?

In [ ]:
# your answer here

#### Print all the rows where job title is associate

In [ ]:
# your answer here

#### Print the first 3 rows of your dataframe

##### Tip : There are 2 ways to do it. Do it both ways

In [ ]:
# your answer here- 1 method

In [ ]:
# your answer here- 2nd method

#### Find the employees who's title is associate and the salary above 55?

In [ ]:
# your answer here

#### Group the employees based on their number of years of employment. What are the average salaries in each group?

In [ ]:
# your answer here

####  What is the average Salary per title?

In [ ]:
# your answer here

#### Show a visual summary of the data using boxplot. What Are the First and Third Quartiles? Comment your results.
##### * Hint : Quantiles vs Quartiles*
##### - `In Probability and Statistics, quantiles are cut points dividing the range of a probability distribution into continuous intervals with equal probabilities. When division is into four parts the values of the variate corresponding to 25%, 50% and 75% of the total distribution are called quartiles.`

In [ ]:
# print first quartile here

In [ ]:
# print third quartile here

#### Is the mean salary per gender different?

In [ ]:
# your answer here

#### Find the minimum, mean and the maximum of all numeric columns for each Department.

##### Hint: Use functions from Data Manipulation lesson

In [ ]:
# your answer here

### Bonus Question

#### For each department, compute the difference between the maximal salary and the minimal salary.

##### * Hint: try using `agg` or `apply` and `lambda`*

In [ ]:
# your answer here

# Challenge 3

#### Open the Orders.csv dataset. Name your dataset orders

In [ ]:
# your answer here

#### Explore your dataset by looking at the data types and the summary statistics. Comment your results

In [ ]:
# your answer here

In [ ]:
# your answer here

####  What is the average Purchase Price?

In [ ]:
# your answer here

#### What were the highest and lowest purchase prices?

In [ ]:
# your answer here

In [ ]:
# your answer here

#### Select all the customers we have in Spain

In [ ]:
# your answer here

#### How many customers do we have in Spain?
##### Hint : Use value_counts()

In [ ]:
# your answer here

#### Select all the customers who have bought more than 50 items ?

In [ ]:
# your answer here

#### Select orders from Spain that are above 50 items

In [ ]:
# your answer here

#### Select all free orders

In [ ]:
# your answer here

#### Select all orders that are 'lunch bag'
#### Hint: Use string functions

In [ ]:
# your answer here

#### Select all orders that are made in 2011 and are 'lunch bag'

In [ ]:
# your answer here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your answer here

#### Select all orders made in the month of August

In [ ]:
# your answer here

#### Select how many orders are made by countries in the month of August
##### Hint: Use value_counts()

In [ ]:
# your answer here

#### What's the  average amount of money spent by country

In [ ]:
# your answer here

#### What's the most expensive item?

In [ ]:
# your answer here

#### What was the average amount spent per year ?

In [ ]:
# your answer here